/******************************************************************************/
/**
 * @file: HWASpeedLimit.h
 * @brief 道路限速模块头文件
 * @version: 3.0
 * @author:
 * @copyright: Copyright (c)  All Rights Reserved
 * @date: 2020-8-3 14:12:07
 */
 /******************************************************************************/
#ifndef _HWA_SPEED_LIMIT_H_
#define _HWA_SPEED_LIMIT_H_

/*
********************************************************************************
* Include files section
********************************************************************************
*/
#include "HWA_R.h"

/*
********************************************************************************
* Typedef Section
********************************************************************************
*/




/*
********************************************************************************
* Declaration of API Functions Section
********************************************************************************
*/
#ifdef __cplusplus
extern "C" {
#endif
/******************************************************************************/
/**
* @fn HWASpeedLimit
* @var HWAKernel
* @var HWAEHRPack
* @var HWATSRPack
* @var HWAHUTPack
*/
/******************************************************************************/
ABool HWASpeedLimit(HWAKernel* pst_kernel, HWAEHRPack* pst_ehr_pack, HWATSRPack* pst_tsr_pack);

#ifdef __cplusplus
}
#endif


#endif /* _HWA_SPEED_LIMIT_H_ */